{
  "errors": [],
  "results": [
    {
      "categoryId": 2,
      "cleanName": "Legendary Modern Decks Box Set",
      "extendedData": [
        {
          "displayName": "Description",
          "name": "Description",
          "value": "Dive in and experience three Legendary Decks at once with Legendary Modern Decks 2026, as we combine three Decks of the modern age into one awesome package (with brand-new cards!)\r\n\u003cbr\u003e“Sky Strikers” first blasted off in Dark Saviors back in 2018 and were an instant hit, with their ace pilots soaring into action in their sleek combat mech suits. “Sky Strikers” recently performed on the biggest stage of them all when we saw them make it all the way to the Top 4 of the Yu-Gi-Oh! World Championship 2025! On top of all the old “Sky Striker” favorites, all in one package, you’ll have everything you need for a top “Sky Striker” Deck when you add the NEW Sky Striker Ace – Camellia, Prototype Sky Striker Ace – Amatsu, Surgical Striker – S.P.E.C.T.R.A., and Combined Maneuver – Engage Zero!\r\n\u003cbr\u003eReady the troops! Gottoms is back, and his army awaits him! “X-Sabers” made their first worldwide appearance in 2009’s Hidden Arsenal, with their tactics of swarming and Synchro Summoning. Now, over 15 years later, their legend is renewed with brand-new “X-Saber” cards, plus everyone’s favorite veterans, including new foil upgrades!\r\n\u003cbr\u003eHow long does it take to become Legendary? If you’ve Dueled competitively in 2025, you’ll know that there’s nothing quite like the powerful Ritual-based strategy, “Mitsurugi”, and it’s less than a year old, debuting in January’s Supreme Darkness! With the Legendary Modern Decks 2026 set, you can get everything you need for this tournament-winning strategy, all in one place! “Mitsurugi” works great on its own, or you can combine this Deck with other themes like “Fiendsmith”, “Ryzeal”, “Orcust”, and more (recently reprinted in Battles of Legend: Monster Mayhem and the 2025 Mega-Packs)!\r\n\u003cbr\u003eLegendary Modern Decks 2026 contains THREE complete, ready-to-play Decks, each with 55 cards (1 Secret Rare, 6 Ultra Rares, 48 Commons) plus a bonus 56th card, another copy of 1 of 6 cards from that Deck, with a bonus chance to upgrade to Starlight Rare instead!  Each Deck is built to be tournament-ready with a full Main Deck and Extra Deck. Including brand-new cards!\r\n\u003cbr\u003eJust like with Legendary 5D’s Decks, these Decks are ready-to-go, with the doubles and triples of critical cards you’ll need to make your Deck run nice and smooth. Also, like the Legendary 5D’s Decks, they’re stocked with multiples of “staple” cards that go great in ANY Deck. A great starting place for new, returning, and experienced Duelists.\r\n\u003cbr\u003eLegendary Modern Decks 2026 contains 168 cards:\r\n\u003cbr\u003e3 Secret Rares\r\n\u003cbr\u003e18 Ultra Rares\r\n\u003cbr\u003e144 Common\r\n\u003cbr\u003e3 bonus Secret Rares, with a chance to upgrade to Starlight Rare instead!"
        },
        {
          "displayName": "UPC",
          "name": "UPC",
          "value": "083717870951"
        }
      ],
      "groupId": 24549,
      "imageCount": 1,
      "imageUrl": "https://tcgplayer-cdn.tcgplayer.com/product/668392_200w.jpg",
      "modifiedOn": "2026-01-08T20:45:10.827",
      "name": "Legendary Modern Decks: Box Set",
      "presaleInfo": {
        "isPresale": true,
        "note": "This product is a Presale item with an estimated shipping date of 3/13/2026. Please keep in mind card details, including rarity and card name, may change up until release date as information is updated.",
        "releasedOn": "2026-03-13T00:00:00"
      },
      "productId": 668392,
      "url": "https://www.tcgplayer.com/product/668392/yugioh-legendary-modern-decks-2026-legendary-modern-decks-box-set"
    }
  ],
  "success": true,
  "totalItems": 1
}