{
  "errors": [],
  "results": [
    {
      "categoryId": 1,
      "cleanName": "K SWISS Jace Beleren Sneakers",
      "extendedData": [
        {
          "displayName": "Rules Text Contains",
          "name": "OracleText",
          "value": "Referencing its 25 years of character heritage, the Magic: The Gathering x K-Swiss Gstaad ’86 is inspired by one of the most beloved characters, Jace Beleren. Elements of the popular Planeswalker have been imbued onto the premium leather overlays underlays that make up the upper. The master of mental magic’s costume design informs the glow-in-the-dark details, leather collar lining, printed designs, rubber outsole and extra laces. Other decorative points include the metal lace clip-ons and a debossed Magic: The Gathering logo at the tongue and a sublimated sockliner of Jace’s artwork. \u003cbr\u003e\u003cbr\u003eLimited to just 300 pairs, each shoe comes in a special-edition box and accompanying themed tissue paper packing. Sold via Hasbro Pulse on 9/1/2020 as part of the Zendikar Rising Magic Stream Event.\r\n\u003cbr\u003e\r\n\u003cbr\u003e• Premium leather overlays and underlays\r\n\u003cbr\u003e• Glow-in-dark leather collar lining inspired by Jace’s power\r\n\u003cbr\u003e• Glow-in-dark printing designs inspired by Jace’s costume\r\n\u003cbr\u003e• Gunmetal polished hardware\r\n\u003cbr\u003e• Debossed Magic The Gathering logo on the tongue\r\n\u003cbr\u003e• Metal lace clip-ons modeled after Jace’s character design\r\n\u003cbr\u003e• Cut and buff EVA with rubber outsole construction\r\n\u003cbr\u003e• Glow-in-dark rubber outsole inspired by Jace’s power\r\n\u003cbr\u003e• Glow-in-dark extra laces inspired by Jace’s power\r\n\u003cbr\u003e• Sublimated sockliner of Jace artwork\r\n\u003cbr\u003e• Special edition box and tissue paper\r\n\r\n\u003cbr\u003e\u003cbr\u003eSee individual listing with photo to find your size."
        }
      ],
      "groupId": 2712,
      "imageCount": 2,
      "imageUrl": "https://tcgplayer-cdn.tcgplayer.com/product/221788_200w.jpg",
      "modifiedOn": "2020-10-09T13:00:12.65",
      "name": "K-SWISS Jace Beleren Sneakers",
      "presaleInfo": {
        "isPresale": false,
        "note": null,
        "releasedOn": null
      },
      "productId": 221788,
      "url": "https://www.tcgplayer.com/product/221788/magic-magic-the-gathering-apparel-k-swiss-jace-beleren-sneakers"
    }
  ],
  "success": true,
  "totalItems": 1
}